<?php $lang="/ar";
if(isset($_GET['lang']))
{
    $lang = checkPost($_GET['lang']);
    $lang = Show($lang);
    if(strlen($lang) > 4)
    {
        header("location:/ar");
    }
}


if($lang === "/fa")
{
    //fa --  زبان فارسی
    $html_lang = "fa";
    $l1 = "VPN";
    $l2 = "طالع ازدواج";
    $l3 = "استخاره ابجد";
    $l4 = "فرد غائب";
    $l5 = "شراکت دو نفر";
    $l6 = "براورده شدن حاجت";
    $l7 = "زمان مرگ";
    $l8 = "اقامت در محل";
    $l9 = "نام همزاد ها";
    $l10 = "تغییر اسم";
    $l11 = "روز";
    $l12 = "ماه";
    $l13 = "نام پسر";
    $l14 = "نام مادر پسر";
    $l15 = "نام دختر";
    $l16 = "نام مادر دختر";
    $l17 = "طالع بینی";
    $l18 = "آقا";
    $l19 = "خانم";
    $l20 = "سال";
    $l21 = "کلیک کن";
    $l22 = "شنبه";
    $l24 = "یکشنبه";
    $l25 = "دوشنبه";
    $l26 = "سه شنبه";
    $l27 = "چهار شنبه";
    $l28 = "پنج شنبه";
    $l29 = "جمعه";
    $l30 = "نام شخص اول";
    $l31 = "نام شخص دوم";
    $l32 = "نام حاجت";
    $l33 = "اسم محل اقامت";
    $l34 = "نام خود";
    $l35 = "نام مادر";
    $l36 = "ادامه و پرداخت";
    $l37 = "تایید";
    $l38 = "ثبت نام";
    $l39 = "ورود با اکانت پوپل";
    $l40 = "ایمیل";
    $l41 = "کلمه عبور";
    $l44 = "لطفا ایمیل خود را به درستی وارد نمایید";
    $l45 = "ایمیل یا کلمه عبور شما اشتباه است";
    $l46 = "زبان";
    $l47 = "درباره ما";
    $l48 = "تماس با ما";
    $l49 = "وبلاگ";
    $l50 = "با تشکر از پرداخت شما";
    $l51 = "مشکلی در روند پرداخت به وجود امده لطفا مجددا تلاش کنید";
    $l52 = "نام همزاد  جنی";
    $l53 = "نام همزاد ملکی";
    $site_title = "طالع بینی و کشف رموز ابجد الاسرار";
    $desc_site = "توضیحات سایت";
    $keyword_site = "کلمات کلیدی سایت";
    $l54 = "الاسم الغائب";
    $l55 = "الاسم ام الغائب";
    $l56 = "ثبت نام شما با موفقیت انجام شد";
    $l57 = "با تشکر ";
    $l58 = "نام و نام خانوادگی";
    $l59 = "ارسال پیام";
    $l60 = "پیام شما با موفیقت ارسال شد";
    $l61="انصراف";

}
if($lang === "/ar")
{
    //ar --  زبان عربی
    $html_lang = "ar";
    $l1 = "کتیب";
    $l2 = "ابراج الزوج";
    $l3 = "ابجد الستخاره";
    $l4 = "شرط الغائب";
    $l5 = "شراکت البین الشخصین";
    $l6 = "تلبیه الحاجت";
    $l7 = "وقت الموت";
    $l8 = "الاقامه فی المکان معین";
    $l9 = "اسم التوام";
    $l10 = "تفاصیل السم";
    $l11 = "الیوم";
    $l12 = "الشهر";
    $l13 = "اسم الپسر ";
    $l14 = "اسم ام الپسر";
    $l15 = "اسم البنت ";
    $l16 = "اسم البنت الام";
    $l17 = "الطالع بینی";
    $l18 = "مذکر";
    $l19 = "مونث";
    $l20 = "عام";
    $l21 = "الکلیک";
    $l22 = "الشنبه";
    $l24 = "الیکشنبه";
    $l25 = "الدوشنبه";
    $l26 = "السه شنبه";
    $l27 = "الچهار شنبه";
    $l28 = "الپنج شنبه";
    $l29 = "الجمعه";
    $l30 = "النام شخص اول";
    $l31 = "النام شخص دوم";
    $l32 = "النام حاجت";
    $l33 = "الاسم محل اقامت";
    $l34 = "النام خود";
    $l35 = "نام مادرال";
    $l36 = "الادامه و پرداخت";
    $l37 = "حسنا";
    $l38 = "الثبت نام";
    $l39 = "ورود با اکانت پوپلال";
    $l40 = "الایمیل";
    $l41 = "کلمه عبورال";
    $l44 = "لطفا ایمیل خود را به درستی وارد نماییدال";
    $l45 = "ایمیل یا کلمه عبور شما اشتباه استال";
    $l46 = "الزبان";
    $l47 = "الدرباره ما";
    $l48 = "التماس با ما";
    $l49 = "الوبلاگ";
    $l50 = "البا تشکر از پرداخت شما";
    $l51 = "مشکلی در روند پرداخت به وجود امده لطفا مجددا تلاش کنیدلا";
    $l52 = "النام همزاد  جنی";
    $l53 = "لنام همزاد ملکی";
    $site_title = "طالع بینی و کشف رموز ابجد الاسرارال";
    $desc_site = "التوضیحات سایت";
    $keyword_site = "کلمات کلیدی سایتال";
    $l54 = "الاسم الغائب";
    $l55 = "الاسم ام الغائب";
    $l56 = "ثبت نام شما با موفقیت انجام شد";
    $l57 = "با تشکر ";
    $l58 = "نام و نام خانوادگی";
    $l59 = "ارسال پیام";
    $l60 = "پیام شما با موفیقت ارسال شد";
    $l61="انصراف";
}


// توابع چک کردن پارامتر های ورودی
function checkPost($w)
{
    $Return1 = htmlspecialchars($w);
    $Return2 = stripslashes($Return1);
    $Return3 = htmlentities($Return2);//xss حفاظت در برابر حملات
    $Return4 = strip_tags($Return3);//xss حفاظت در برابر حملات
    $Return5 = trim($Return4);
    return $Return5;
}
function Show($text)
{
	return  htmlspecialchars_decode(html_entity_decode($text));
}
?>

